In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.neighbors import KNeighborsClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import confusion_matrix, f1_score, recall_score, accuracy_score, precision_score

In [2]:
df2 = pd.read_csv("train (1).csv")
df1 = pd.read_csv("test (1).csv")
print(len(df2))
df = pd.concat([df2, df1])

891

c:\users\utkarsh\appdata\local\programs\python\python36\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  after removing the cwd from sys.path.

In [3]:
df

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450
...,...,...,...,...,...,...,...,...,...,...,...,...
413,NaN,NaN,S,8.0500,"Spector, Mr. Woolf",0,1305,3,male,0,NaN,A.5. 3236
414,39.0,C105,C,108.9000,"Oliva y Ocana, Dona. Fermina",0,1306,1,female,0,NaN,PC 17758
415,38.5,NaN,S,7.2500,"Saether, Mr. Simon Sivertsen",0,1307,3,male,0,NaN,SOTON/O.Q. 3101262
416,NaN,NaN,S,8.0500,"Ware, Mr. Frederick",0,1308,3,male,0,NaN,359309
417,NaN,NaN,C,22.3583,"Peter, Master. Michael J",1,1309,3,male,1,NaN,2668

In [4]:
df['Cabin'].isnull().sum()

1014

In [5]:
df.drop(['Cabin','Ticket','PassengerId','Name'], axis = 1, inplace=True)

In [6]:
df["Age"].isnull().sum()

263

In [7]:
df["Age"] = df["Age"].fillna(np.mean(df['Age']))

In [8]:
df["Survived"].isnull().sum()

418

In [9]:
df['Parch'].value_counts()

0    1002
1     170
2     113
3       8
5       6
4       6
9       2
6       2
Name: Parch, dtype: int64

In [10]:
df

           Age Embarked      Fare  Parch  Pclass     Sex  SibSp  Survived
0    22.000000        S    7.2500      0       3    male      1       0.0
1    38.000000        C   71.2833      0       1  female      1       1.0
2    26.000000        S    7.9250      0       3  female      0       1.0
3    35.000000        S   53.1000      0       1  female      1       1.0
4    35.000000        S    8.0500      0       3    male      0       0.0
..         ...      ...       ...    ...     ...     ...    ...       ...
413  29.881138        S    8.0500      0       3    male      0       NaN
414  39.000000        C  108.9000      0       1  female      0       NaN
415  38.500000        S    7.2500      0       3    male      0       NaN
416  29.881138        S    8.0500      0       3    male      0       NaN
417  29.881138        C   22.3583      1       3    male      1       NaN

[1309 rows x 8 columns]

In [11]:
df['Embarked'].value_counts()

S    914
C    270
Q    123
Name: Embarked, dtype: int64

In [12]:
##LABEL ENCODER:
from sklearn.preprocessing import LabelEncoder

la = LabelEncoder()

count = 0
for i in range(8):
    print(i, " = ", df.columns[i])
    e = str(df.columns[i])
    if df.dtypes[e] == object:
        df[df.columns[i]] = df[df.columns[i]].astype(str)
        print("count = ",count)
        df[df.columns[i]] = la.fit_transform(df[df.columns[i]])
        count = count + 1
print(df)

0  =  Age
1  =  Embarked
count =  0
2  =  Fare
3  =  Parch
4  =  Pclass
5  =  Sex
count =  1
6  =  SibSp
7  =  Survived
           Age  Embarked      Fare  Parch  Pclass  Sex  SibSp  Survived
0    22.000000         2    7.2500      0       3    1      1       0.0
1    38.000000         0   71.2833      0       1    0      1       1.0
2    26.000000         2    7.9250      0       3    0      0       1.0
3    35.000000         2   53.1000      0       1    0      1       1.0
4    35.000000         2    8.0500      0       3    1      0       0.0
..         ...       ...       ...    ...     ...  ...    ...       ...
413  29.881138         2    8.0500      0       3    1      0       NaN
414  39.000000         0  108.9000      0       1    0      0       NaN
415  38.500000         2    7.2500      0       3    1      0       NaN
416  29.881138         2    8.0500      0       3    1      0       NaN
417  29.881138         0   22.3583      1       3    1      1       NaN

[1309 rows x 8 columns]

In [13]:
train_data = df.iloc[0:891, :]
test_data = df.iloc[891: , :]

In [14]:
train_data

           Age  Embarked     Fare  Parch  Pclass  Sex  SibSp  Survived
0    22.000000         2   7.2500      0       3    1      1       0.0
1    38.000000         0  71.2833      0       1    0      1       1.0
2    26.000000         2   7.9250      0       3    0      0       1.0
3    35.000000         2  53.1000      0       1    0      1       1.0
4    35.000000         2   8.0500      0       3    1      0       0.0
..         ...       ...      ...    ...     ...  ...    ...       ...
886  27.000000         2  13.0000      0       2    1      0       0.0
887  19.000000         2  30.0000      0       1    0      0       1.0
888  29.881138         2  23.4500      2       3    0      1       0.0
889  26.000000         0  30.0000      0       1    1      0       1.0
890  32.000000         1   7.7500      0       3    1      0       0.0

[891 rows x 8 columns]

In [15]:
test_data

           Age  Embarked      Fare  Parch  Pclass  Sex  SibSp  Survived
0    34.500000         1    7.8292      0       3    1      0       NaN
1    47.000000         2    7.0000      0       3    0      1       NaN
2    62.000000         1    9.6875      0       2    1      0       NaN
3    27.000000         2    8.6625      0       3    1      0       NaN
4    22.000000         2   12.2875      1       3    0      1       NaN
..         ...       ...       ...    ...     ...  ...    ...       ...
413  29.881138         2    8.0500      0       3    1      0       NaN
414  39.000000         0  108.9000      0       1    0      0       NaN
415  38.500000         2    7.2500      0       3    1      0       NaN
416  29.881138         2    8.0500      0       3    1      0       NaN
417  29.881138         0   22.3583      1       3    1      1       NaN

[418 rows x 8 columns]

In [16]:
train_x = train_data.drop(['Survived'], axis = 1)
train_y = train_data['Survived']

In [17]:
train_x, test_x, train_y, test_y = train_test_split(train_x, train_y, test_size = .25) 
lr = LogisticRegression(C = 3)
lr.fit(train_x, train_y)

c:\users\utkarsh\appdata\local\programs\python\python36\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=3, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [18]:
lr.score(test_x, test_y)

0.820627802690583

In [19]:
knn = KNeighborsClassifier(n_neighbors = 3)
knn.fit(train_x, train_y)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
                     metric_params=None, n_jobs=None, n_neighbors=3, p=2,
                     weights='uniform')

In [20]:
d = pd.DataFrame(knn.predict(test_x))
d['Real'] = test_y
knn.score(test_x, test_y)

0.6816143497757847

In [21]:
dt = DecisionTreeClassifier()
dt.fit(train_x, train_y)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [22]:
pred = lr.predict(test_x)
pred

array([0., 0., 1., 1., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 1.,
       0., 0., 0., 1., 1., 1., 1., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0.,
       0., 0., 1., 1., 0., 1., 1., 1., 1., 0., 1., 1., 1., 0., 0., 0., 0.,
       0., 0., 0., 1., 1., 0., 1., 0., 0., 1., 1., 0., 1., 0., 1., 0., 0.,
       0., 0., 0., 0., 0., 1., 0., 1., 0., 1., 1., 1., 1., 0., 0., 1., 0.,
       0., 1., 0., 1., 0., 0., 0., 0., 0., 1., 0., 0., 1., 1., 1., 1., 0.,
       0., 1., 0., 1., 0., 0., 1., 1., 1., 1., 1., 0., 0., 0., 0., 1., 1.,
       0., 0., 0., 1., 1., 0., 0., 0., 0., 0., 1., 1., 1., 0., 0., 1., 1.,
       0., 0., 0., 1., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 1.,
       0., 0., 0., 0., 0., 1., 0., 1., 1., 0., 0., 0., 1., 0., 0., 0., 0.,
       1., 0., 0., 0., 1., 0., 1., 0., 1., 1., 0., 0., 1., 0., 1., 0., 0.,
       0., 1., 1., 1., 0., 0., 0., 1., 1., 1., 0., 0., 0., 0., 0., 0., 0.,
       0., 0., 1., 0., 1., 0., 1., 1., 0., 0., 0., 0., 0., 0., 1., 1., 0.,
       0., 0.])

In [23]:
cm = confusion_matrix(pred, test_y)
cm

array([[121,  21],
       [ 19,  62]], dtype=int64)

In [24]:
acc = accuracy_score(pred, test_y)
ps = precision_score(pred, test_y)
rs = recall_score(pred, test_y)
f1 = f1_score(pred, test_y)
print("acc = ", acc)
print("ps = ", ps)
print("rs = ", rs)
print("f1 = ", f1)

acc =  0.820627802690583
ps =  0.7469879518072289
rs =  0.7654320987654321
f1 =  0.7560975609756098

# Hence Logistic Regression gives the best prediction as compared to KNN and Decision Trees